XML/Public/PMSQ03-QQ/request_pre/2022年3月1日/body_PMSQ03-QQ_request_pre_20220301203732.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0><![CDATA[<MBS>
<pub>
    <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
    <SRCBATCHNO>txbPMSQ03_QQ_20220301203730</SRCBATCHNO>
    <TRANSCODE>PMSQ03</TRANSCODE>
    <TRANSDATETIME>2020-03-24 10:00:00</TRANSDATETIME>
    <MD5>123456</MD5>
  </pub>
  <req>
    <head>
      <ALLAMOUNT>600.00</ALLAMOUNT>
      <ALLCOUNT>1</ALLCOUNT>
    </head>
    <list>
      <detail>
        <SRCSERIALNO>testbPMSQ03_QQ_20220301203730</SRCSERIALNO>
        <SRCNOTECODE>testbPMSQ03_QQ1_20220301203730</SRCNOTECODE>
        <ORGCODE>001000</ORGCODE>
        <APPLYORGCODE>001000</APPLYORGCODE>
        <DEPTCODE></DEPTCODE>
        <PAYDATE>2020-03-24</PAYDATE>
        <PAYTYPECODE>103</PAYTYPECODE>
        <SETTLEMENTMODECODE>101</SETTLEMENTMODECODE>
        <CAPITALCATEGORYCODE></CAPITALCATEGORYCODE>
        <BUDGETITEMCODE></BUDGETITEMCODE>
        <ABSTRACTS></ABSTRACTS>
        <ISURGENT>0</ISURGENT>
        <PURPOSE>商务费用</PURPOSE>
        <CHECKCODE></CHECKCODE>
        <OFFICEPURPOSE></OFFICEPURPOSE>
        <MEMO></MEMO>
        <OURORGCODE>001000</OURORGCODE>
        <OURBANKACCOUNTNUMBER>2222222222</OURBANKACCOUNTNUMBER>
        <OURCURCODE>USD</OURCURCODE>
        <OURAMOUNT>600.00</OURAMOUNT>
        <OPPOBJECTNAME>HK HEYCHA LIMITED</OPPOBJECTNAME>
        <OPPOBJECTCODE>000001</OPPOBJECTCODE>
        <OPPCOUNTERPARTYCATEGORYCODE></OPPCOUNTERPARTYCATEGORYCODE>
        <OPPBANKCODE></OPPBANKCODE>
        <OPPBANKLOCATIONCODE></OPPBANKLOCATIONCODE>
        <OPPBANKLOCATIONS>（CIPS专用）中国银行（香港）有限公司</OPPBANKLOCATIONS>
        <OPPBANKACCOUNTNUMBER>94354565</OPPBANKACCOUNTNUMBER>
        <OPPBANKACCOUNTNAME>HK HEYCHA LIMITED</OPPBANKACCOUNTNAME>
        <OPPBANKAREACODE></OPPBANKAREACODE>
        <OPPDIRECTCURCODE>CNY</OPPDIRECTCURCODE>
        <CONTACTS></CONTACTS>
        <OPPCELLPHONE></OPPCELLPHONE>
        <OPPPRIVATEFLAG>1</OPPPRIVATEFLAG>
        <OPPCERTTYPE></OPPCERTTYPE>
        <changdetail>
          <OURREGORGCODE>001000</OURREGORGCODE>
          <OURORGTYPE></OURORGTYPE>
          <OURADDRESS></OURADDRESS>
          <CASHBANKACCOUNTNUMBER>2222222222</CASHBANKACCOUNTNUMBER>
          <CASHBANKACCOUNTNAME></CASHBANKACCOUNTNAME>
          <CASHAMOUNT>30.00</CASHAMOUNT>
          <PURCHASEBANKACCOUNTID></PURCHASEBANKACCOUNTID>
          <PURCHASEBANKACCOUNTNUMBER></PURCHASEBANKACCOUNTNUMBER>
          <PURCHASEBANKACCOUNTNAME></PURCHASEBANKACCOUNTNAME>
          <PURCHASEAMOUNT>0.00</PURCHASEAMOUNT>
          <OTHERBANKACCOUNTID></OTHERBANKACCOUNTID>
          <OTHERBANKACCOUNTNUMBER></OTHERBANKACCOUNTNUMBER>
          <OTHERBANKACCOUNTNAME></OTHERBANKACCOUNTNAME>
          <OTHERAMOUNT>0.00</OTHERAMOUNT>
          <OPPRESIDENTTYPE>FIN</OPPRESIDENTTYPE>
          <OPPCOUNTRYTYPE></OPPCOUNTRYTYPE>
          <OPPADDRESS>ZJ</OPPADDRESS>
          <OPPBRANCHSWIFTCODE>CITIHKHX</OPPBRANCHSWIFTCODE>
          <OPPBRANCHSWIFTNAME></OPPBRANCHSWIFTNAME>
          <OPPRESIDENTCOUNTRYID>HK</OPPRESIDENTCOUNTRYID>
          <OPPRESIDENTCOUNTRYCODE>HK</OPPRESIDENTCOUNTRYCODE>
          <OPPRESIDENTCOUNTRYNAME></OPPRESIDENTCOUNTRYNAME>
          <OPPAGENTBANKID></OPPAGENTBANKID>
          <OPPAGENTAREAID></OPPAGENTAREAID>
          <OPPAGENTBANKLOCATIONID></OPPAGENTBANKLOCATIONID>
          <OPPAGENTBRANCHSWIFTNAME></OPPAGENTBRANCHSWIFTNAME>
          <OPPAGENTBRANCHSWIFTCODE></OPPAGENTBRANCHSWIFTCODE>
          <OPPAGENTACCOUNTNUMBER></OPPAGENTACCOUNTNUMBER>
          <INTERMEDIATECOSTMODE>BEN</INTERMEDIATECOSTMODE>
          <PAYMENTMETHOD>A</PAYMENTMETHOD>
          <ISPAYMENTFORBONDEDGOOD>0</ISPAYMENTFORBONDEDGOOD>
          <PAYMENTPROPERTY>X</PAYMENTPROPERTY>
          <BUSINESSNUMBER></BUSINESSNUMBER>
          <TRANSACTIONCODE1>60001</TRANSACTIONCODE1>
          <CURRENCYID1></CURRENCYID1>
          <CURRENCYCODE1></CURRENCYCODE1>
          <POSTSCRIPT1></POSTSCRIPT1>
          <AMOUNT1>0.00</AMOUNT1>
          <TRANSACTIONCODE2></TRANSACTIONCODE2>
          <CURRENCYID2></CURRENCYID2>
          <CURRENCYCODE2></CURRENCYCODE2>
          <POSTSCRIPT2></POSTSCRIPT2>
          <AMOUNT2>0.00</AMOUNT2>
          <CONTRACTCODE></CONTRACTCODE>
          <INVOICECODE></INVOICECODE>
          <FEEBANKACCOUNTID></FEEBANKACCOUNTID>
          <FEEBANKACCOUNTNUMBER></FEEBANKACCOUNTNUMBER>
          <CONTACTPERSON></CONTACTPERSON>
          <CONTACTNUMBER></CONTACTNUMBER>
          <FUNDSPROPERTY></FUNDSPROPERTY>
          <ISPAYMENTFORIMPORTITEM>0</ISPAYMENTFORIMPORTITEM>
          <ISDOMESTIC>0</ISDOMESTIC>
          <EXCHANGETYPECODE></EXCHANGETYPECODE>
          <TRANSACTIONCODE></TRANSACTIONCODE>
          <EXCHANGECATEGORY></EXCHANGECATEGORY>
          <CREATEDBY>sandy</CREATEDBY>
          <DESCRIPTION></DESCRIPTION>
          <OPPBRANCHRTGSCODE></OPPBRANCHRTGSCODE>
          <OPPBRANCHRTGSNAME></OPPBRANCHRTGSNAME>
        </changdetail>
      </detail>
    </list>
  </req>
</MBS> ]]></out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>